www/doc/cl-vars.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Переменные в Common Lisp (Lispnik)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Переменные в Common Lisp (Lispnik)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3540b8f">Лексические и динамические переменные</a></li>
<li><a href="#org7b531dd">Различия в поведении</a></li>
<li><a href="#orga64bc08">Поведение в замыканиях</a></li>
<li><a href="#orgef8a576">Исправления</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3540b8f" class="outline-2">
<h2 id="org3540b8f">Лексические и динамические переменные</h2>
<div class="outline-text-2" id="text-org3540b8f">
<p>
Многим изучающим язык программирования Common Lisp не до конца ясно различие между
лексическими и динамическими переменными. Я решил написать небольшую статью, в которой
сделана попытка объяснить это различие.
</p>

<p>
Сделаю важное замечание: в CL любая переменная должна быть тем или иным способом
объявлена: с помощью <code>defvar</code> / <code>defparameter</code> или с помощью <code>let</code>. В стандарте ANSI
указано, что последствия использования необъявленных переменных не определены, то есть
конкретная реализация может делать в этом случае всё, что захочет: может выдать
сообщение об ошибке, может молча объявить эту переменную как лексическую или (более
вероятно) как динамическую. Так что примеры в двухтомнике Хювеннена-Сеппянена и в книге
Пола Грэхэма ANSI Common Lisp, в которых в командной строке с помощью <code>setf</code> / <code>setq</code>
присваиваются значения необъявленным переменным, не корректны. Однако, извинением
авторам служит то, что книги были вышли до принятия окончательной версии стандарта ANSI
Common Lisp, в котором это было зафиксировано.
</p>

<p>
Самые первые версии Лиспа имели только динамические переменные. Насколько мне известно,
первым диалектом Лиспа с лексическими переменными была Схема (Scheme). В Common Lisp
переменные по умолчанию являются лексическими, а динамические переменные должны быть
соответствующим образом объявлены.
</p>

<p>
Указать, что переменная <code>динамическая</code>, можно следующими способами:
</p>
<ul class="org-ul">
<li><p>
Указать её имя в defvar или defparameter:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defvar *special-var1* nil)
(defparameter *special-var2* nil)
</pre>
</div></li>
<li><p>
Указать её имя в декларации <code>special</code>.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(let ((*test* nil))
  (declare (special *test*))
  (do-something-special))
</pre>
</div>
<p>
Или даже так:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defun something-special2 (lex-var1 *test* lex-var2)
  (declare (special *test* *test2*))
  (do-something-special lex-var1 *test* *test2* lex-var2))
</pre>
</div></li>
</ul>

<p>
Все остальные переменные будут <code>лексическими</code>.
</p>

<p>
Имена динамических переменных обрамляются звёздочками по традиции, чтобы можно по имени
переменной понять, является ли она динамической.
</p>

<p>
А теперь рассмотрим различия в поведении лексических и динамических переменных.
</p>
</div>
</div>

<div id="outline-container-org7b531dd" class="outline-2">
<h2 id="org7b531dd">Различия в поведении</h2>
<div class="outline-text-2" id="text-org7b531dd">
<p>
Главное различие — область видимости. <b>Лексическая</b> переменная видна только в теле той
формы, в которой она была объявлена (в теле функции в случае <code>defun</code>, в теле <code>let</code> в
случае <code>let</code>, и т.д.). <b>Динамическая</b> переменная, даже если она была создана локально с
помощью <code>let</code>, видна во всех вызываемых функциях, пока действительно связывание с
помощью <code>let</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(defun test1 (a)
  (declare (special *somevar*))
  (+ a *somevar*))

(defun test2 (b)
  (let ((*somevar* 10) (anothervar 20))
    (declare (special *somevar*))
    (test1 (1+ b))))
</pre>
</div>

<p>
В данном примере значение переменная <code>*somevar*</code>, которое было ей присвоено в
<code>test2</code>, видно и в функции <code>test1</code>, а вот значение лексической переменной <code>anothervar</code>
в <code>test1</code> нельзя узнать вообще никак.
</p>

<p>
Интересным является то, что связывания динамических переменных, созданные с помощью
<code>let</code> (а так же с другими формами, осуществляющими связывание, например
<code>with-open-file</code> или <code>defun</code> и <code>lambda</code>, создающими связывания для своих аргументов)
влияют на все вложенные вызовы функций (если они, конечно, сами не связывают те же
переменные). После выхода из <code>let</code> восстанавливается предыдущее связывание, если оно
было. Вот как это можно использовать: допустим, у нас есть функция <code>funny-print</code>,
которая что-то печатает на экране, используя стандартную динамическую переменную
<code>*output-stream*</code>. Используя <code>let</code>, мы можем "подменить" её значение, заставив функцию
печатать в файл или строку:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(with-output-to-string (*output-stream*)
  (funny-print some-object))
</pre>
</div>

<p>
Таким образом, динамические переменные можно рассматривать как неявные параметры. Можно
было бы организовать подобные параметры с помощью ключей или необязательных параметров,
но если у вас есть несколько функций, работающих совместно и использующих один и тот же
параметр, то явная его передача из одной функции в другую может быть утомительна.
</p>

<p>
Можно считать, что с каждой динамической переменной связан специальный стек
связываний. Вычисления и присваивания (<code>setf</code> / <code>setq</code> / <code>set</code>) работают со
связыванием, которое расположено на вершине стека. Каждая форма <code>let</code> (и эквивалентные
ей), в которой указана динамическая переменная, в начале помещает на стек новое
связывание и удаляет его в конце выполнения. При этом все манипуляции, которые
выполнялись над этим связыванием, влияют только на это связывание, поэтому иногда можно
увидеть код, подобный следующему:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(let ((*somevar* *somevar*))
  ;; вычисления, которые могут модифицировать *somevar*, но мы этого не хотим
  )
</pre>
</div>

<p>
После выполнения этой формы старое значение <code>*somevar*</code> останется неизменным, что бы не
происходило внутри этой формы.
</p>
</div>
</div>

<div id="outline-container-orga64bc08" class="outline-2">
<h2 id="orga64bc08">Поведение в замыканиях</h2>
<div class="outline-text-2" id="text-orga64bc08">
<p>
Лексические и динамические переменные ведут себя по-разному в замыканиях. А именно,
связывания лексических переменных запоминаются при создании замыкания (как говорят,
сохраняется лексическое окружение), а связывания динамических переменных - нет, при
каждом вызове замыкания значения берутся из вызываемого окружения. Вот простой пример:
</p>

<div class="org-src-container">
<pre class="src src-lisp">;; динамическая переменная, которую мы
;; будем использовать в замыкании
(defvar *shift1* 100)

;;; Создаём замыкание, в котором лексический контекст состоит
;;; из переменной shift2.  Отметим, что в теле лямбда-выражения
;;; переменная x также является лексической
(defvar *test-closure*    ; тоже динамическая, но это не важно
  (let ((shift2 20))
    (lambda (x) (+ x *shift1* shift2))))

;;; Пробуем
(funcall *test-closure* 3)
=&gt; 123

;;; Создаём новое связывание *shift1*:
(let ((*shift1* 400))
  (funcall *test-closure* 3))
=&gt; 423

;;; Создаём новое связывание shift2:
(let ((shift2 40))
  (funcall *test-closure* 3))
=&gt; 123
</pre>
</div>

<p>
Как видим, в последнем примере результат не изменился!  Все глобальные переменные в
Common Lisp являются динамическими! Глобальных лексических переменных в Common Lisp
нет, хотя их можно имитировать с помощью макросимволов.
</p>

<p>
Если же нужно запомнить в замыкании значение динамической переменной во время создания
замыкания (значение, а не связывание, которое запомнить невозможно), то можно
воспользоваться временной лексической переменной:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(let ((temp-lexical *dynamic-var*)) ; запоминаем
  (lambda (x)
    (let ((*dynamic-var* temp-lexical)) ; восстанавливаем
      (some-fun-that-uses-dinamyc-var x))))
</pre>
</div>

<p>
И последнее отличие, которое я упомяну, заключается в том, что динамическая переменная
может не иметь значения, в то время как у лексической переменной всегда есть какое-то
значение. Это происходит тогда, когда переменная объявляется динамической с помощью
defvar или декларации special, но никакое значение ей не присваивается.
</p>
</div>
</div>

<div id="outline-container-orgef8a576" class="outline-2">
<h2 id="orgef8a576">Исправления</h2>
<div class="outline-text-2" id="text-orgef8a576">
<p>
Оригинал этой статьи написан и опубликован <code>lispnik</code> (Иван Болдырев)
Ссылка на оригинал: <a href="http://lispnik.livejournal.com/9137.html">http://lispnik.livejournal.com/9137.html</a>
Копия: <a href="http://lisper.ru/articles/cl-vars">http://lisper.ru/articles/cl-vars</a>
</p>

<p>
Обновлено и исправлено 3 февраля 2004.
Исправлено 4 февраля 2004 (ошибку указал Anton Kovalenko).
Исправлено 5 февраля 2004 (ошибку указал anonymous).
Исправлено 27 мая 2010 г. (ошибки указал anonymous).
</p>
</div>
</div>
</div>
</body>
</html>
